ideas.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-05-16 Fri 19:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Challenging Thesis Ideas in Software Development, Cybersecurity, Gaming, and Web Scraping</title>
<meta name="author" content="Kornel Hajto" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/search.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Challenging Thesis Ideas in Software Development, Cybersecurity, Gaming, and Web Scraping</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgafa7ca2">1. Introduction</a></li>
<li><a href="#orgaf786d6">2. 1. AI-Driven Anti-Cheat Systems for Multiplayer Games</a>
<ul>
<li><a href="#org1ee698e">2.1. Motivation</a></li>
<li><a href="#orge704d1e">2.2. Research Objective</a></li>
<li><a href="#orgf8732e2">2.3. Methodology</a></li>
<li><a href="#org0e8f1f1">2.4. Expected Contributions</a></li>
</ul>
</li>
<li><a href="#orgaa1e012">3. 2. Ethical Web Scraping with Advanced Anti-Detection Techniques</a>
<ul>
<li><a href="#org96b3b2a">3.1. Motivation</a></li>
<li><a href="#org417bf06">3.2. Research Objective</a></li>
<li><a href="#orgfb9425c">3.3. Methodology</a></li>
<li><a href="#org07977b1">3.4. Expected Contributions</a></li>
</ul>
</li>
<li><a href="#org23fabca">4. 3. Automated Vulnerability Detection Using Large Language Models (LLMs)</a>
<ul>
<li><a href="#org9b8edd8">4.1. Motivation</a></li>
<li><a href="#org4da1531">4.2. Research Objective</a></li>
<li><a href="#org1afd61f">4.3. Methodology</a></li>
<li><a href="#org8e0b589">4.4. Expected Contributions</a></li>
</ul>
</li>
<li><a href="#orgae93cfd">5. 4. Blockchain for Secure and Transparent In-Game Economies</a>
<ul>
<li><a href="#orgd458361">5.1. Motivation</a></li>
<li><a href="#orgacf6b1c">5.2. Research Objective</a></li>
<li><a href="#orge77fd14">5.3. Methodology</a></li>
<li><a href="#org6943dde">5.4. Expected Contributions</a></li>
</ul>
</li>
<li><a href="#orgf1aac07">6. 5. Dark Web Scraping for Real-Time Threat Intelligence</a>
<ul>
<li><a href="#orgc6b9fd4">6.1. Motivation</a></li>
<li><a href="#orgab817fb">6.2. Research Objective</a></li>
<li><a href="#org1163b0f">6.3. Methodology</a></li>
<li><a href="#orgbf19575">6.4. Expected Contributions</a></li>
</ul>
</li>
<li><a href="#org238283b">7. 6. Quantum-Resistant Cryptography for IoT in Smart Cities</a>
<ul>
<li><a href="#org8fb8a25">7.1. Motivation</a></li>
<li><a href="#orgb892a30">7.2. Research Objective</a></li>
<li><a href="#org600a2fc">7.3. Methodology</a></li>
<li><a href="#org2ebd4f0">7.4. Expected Contributions</a></li>
</ul>
</li>
<li><a href="#org857c20c">8. 7. AI-Powered Threat Detection in Autonomous Vehicles</a>
<ul>
<li><a href="#org2e96d20">8.1. Motivation</a></li>
<li><a href="#org47ab9ea">8.2. Research Objective</a></li>
<li><a href="#org6c5ae5e">8.3. Methodology</a></li>
<li><a href="#org4fa9d97">8.4. Expected Contributions</a></li>
</ul>
</li>
<li><a href="#orgf88d5ab">9. 8. Privacy-Preserving Social Media Analytics</a>
<ul>
<li><a href="#orgfae50f5">9.1. Motivation</a></li>
<li><a href="#org875d7cf">9.2. Research Objective</a></li>
<li><a href="#org497b2a9">9.3. Methodology</a></li>
<li><a href="#org5668e88">9.4. Expected Contributions</a></li>
</ul>
</li>
<li><a href="#org7c541ec">10. 9. AI-Generated Code Security Auditing</a>
<ul>
<li><a href="#org9f26d04">10.1. Motivation</a></li>
<li><a href="#org2ee3843">10.2. Research Objective</a></li>
<li><a href="#orga63d4fe">10.3. Methodology</a></li>
<li><a href="#org76acb36">10.4. Expected Contributions</a></li>
</ul>
</li>
<li><a href="#org23ff3b8">11. 10. Web Scraping for Climate Risk Modeling</a>
<ul>
<li><a href="#orgbe48000">11.1. Motivation</a></li>
<li><a href="#orgc759821">11.2. Research Objective</a></li>
<li><a href="#org669b011">11.3. Methodology</a></li>
<li><a href="#org1674c41">11.4. Expected Contributions</a></li>
</ul>
</li>
<li><a href="#org973269e">12. Evaluation Criteria</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgafa7ca2" class="outline-2">
<h2 id="orgafa7ca2"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This document presents a curated list of advanced and challenging thesis topics spanning software development, cybersecurity, gaming, and web scraping. Emphasizing cutting-edge technologies such as artificial intelligence (AI), blockchain, quantum computing, and ethical computing, these ideas reflect recent research trends and industry needs. Projects range from advanced threat intelligence systems and post-quantum cryptography implementations to innovative, privacy-conscious web scraping techniques. The goal is to inspire research that combines technical rigor with practical impact.
</p>
</div>
</div>
<div id="outline-container-orgaf786d6" class="outline-2">
<h2 id="orgaf786d6"><span class="section-number-2">2.</span> 1. AI-Driven Anti-Cheat Systems for Multiplayer Games</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org1ee698e" class="outline-3">
<h3 id="org1ee698e"><span class="section-number-3">2.1.</span> Motivation</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Cheating in multiplayer games undermines fair play, damages community trust, and causes substantial financial losses. Modern cheat tools increasingly leverage AI (e.g., AI-powered aimbots), evolving faster than conventional detection methods. Traditional heuristics and rule-based anti-cheat systems struggle to keep pace with such sophisticated attacks.
</p>
</div>
</div>
<div id="outline-container-orge704d1e" class="outline-3">
<h3 id="orge704d1e"><span class="section-number-3">2.2.</span> Research Objective</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Develop an adaptive AI-based anti-cheat system that detects cheating behavior by analyzing in-game telemetry data, such as mouse movements, aiming patterns, and player statistics (kill/death ratios), identifying subtle anomalies indicative of cheating.
</p>
</div>
</div>
<div id="outline-container-orgf8732e2" class="outline-3">
<h3 id="orgf8732e2"><span class="section-number-3">2.3.</span> Methodology</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>Collect large-scale, anonymized gameplay telemetry data.</li>
<li>Design and train machine learning models to classify player behavior patterns, distinguishing legitimate from malicious actions.</li>
<li>Employ federated learning to allow model training across decentralized player devices, preserving privacy and reducing central data aggregation risks.</li>
<li>Validate detection accuracy with real-world datasets and controlled cheat simulations.</li>
</ul>
</div>
</div>
<div id="outline-container-org0e8f1f1" class="outline-3">
<h3 id="org0e8f1f1"><span class="section-number-3">2.4.</span> Expected Contributions</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li>A novel, privacy-preserving framework for anti-cheat detection.</li>
<li>Demonstration of federated learning applicability in real-time gaming environments.</li>
<li>Enhanced robustness against evolving AI-driven cheats.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgaa1e012" class="outline-2">
<h2 id="orgaa1e012"><span class="section-number-2">3.</span> 2. Ethical Web Scraping with Advanced Anti-Detection Techniques</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org96b3b2a" class="outline-3">
<h3 id="org96b3b2a"><span class="section-number-3">3.1.</span> Motivation</h3>
<div class="outline-text-3" id="text-3-1">
<p>
As websites increasingly deploy sophisticated bot detection systems (e.g., Cloudflare Bot Management) leveraging AI and fingerprinting, traditional scraping tools face blocking and throttling. Ethical scraping must balance data acquisition with respect for site policies, privacy, and legal frameworks.
</p>
</div>
</div>
<div id="outline-container-org417bf06" class="outline-3">
<h3 id="org417bf06"><span class="section-number-3">3.2.</span> Research Objective</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Design a reinforcement learning (RL)-based web scraper that mimics authentic human browsing behavior, thereby minimizing detection risk while adhering to ethical guidelines.
</p>
</div>
</div>
