ideas.html
<div id="outline-container-org7c541ec" class="outline-2">
<h2 id="org7c541ec"><span class="section-number-2">10.</span> 9. AI-Generated Code Security Auditing</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org9f26d04" class="outline-3">
<h3 id="org9f26d04"><span class="section-number-3">10.1.</span> Motivation</h3>
<div class="outline-text-3" id="text-10-1">
<p>
AI-generated code, increasingly prevalent via tools like GitHub Copilot, may unintentionally embed security flaws or malicious backdoors. Automated auditing is necessary to maintain code integrity.
</p>
</div>
</div>
<div id="outline-container-org2ee3843" class="outline-3">
<h3 id="org2ee3843"><span class="section-number-3">10.2.</span> Research Objective</h3>
<div class="outline-text-3" id="text-10-2">
<p>
Create a static analysis tool augmented by machine learning trained to detect hidden malicious patterns in AI-generated procedural code, focusing on platforms like Unity Asset Store.
</p>
</div>
</div>
<div id="outline-container-orga63d4fe" class="outline-3">
<h3 id="orga63d4fe"><span class="section-number-3">10.3.</span> Methodology</h3>
<div class="outline-text-3" id="text-10-3">
<ul class="org-ul">
<li>Collect and label datasets containing malicious and benign Unity assets.</li>
<li>Train ML classifiers to identify suspicious code structures and behaviors.</li>
<li>Integrate the tool into developer workflows for real-time auditing.</li>
<li>Validate efficacy in identifying stealth backdoors.</li>
</ul>
</div>
</div>
<div id="outline-container-org76acb36" class="outline-3">
<h3 id="org76acb36"><span class="section-number-3">10.4.</span> Expected Contributions</h3>
<div class="outline-text-3" id="text-10-4">
<ul class="org-ul">
<li>Novel datasets for AI-generated code security research.</li>
<li>Automated auditing tools to improve software supply chain security.</li>
<li>Guidelines for safer AI-assisted software development.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org23ff3b8" class="outline-2">
<h2 id="org23ff3b8"><span class="section-number-2">11.</span> 10. Web Scraping for Climate Risk Modeling</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-orgbe48000" class="outline-3">
<h3 id="orgbe48000"><span class="section-number-3">11.1.</span> Motivation</h3>
<div class="outline-text-3" id="text-11-1">
<p>
Climate data is dispersed across multiple sources, often lacking integration necessary for accurate flood and fire risk prediction. Automated data aggregation supports timely, localized risk assessments.
</p>
</div>
</div>
<div id="outline-container-orgc759821" class="outline-3">
<h3 id="orgc759821"><span class="section-number-3">11.2.</span> Research Objective</h3>
<div class="outline-text-3" id="text-11-2">
<p>
Develop a comprehensive web scraping framework to aggregate climate data from APIs (NOAA, Wunderground) and satellite imagery for spatial-temporal analysis of flood and fire risks.
</p>
</div>
</div>
<div id="outline-container-org669b011" class="outline-3">
<h3 id="org669b011"><span class="section-number-3">11.3.</span> Methodology</h3>
<div class="outline-text-3" id="text-11-3">
<ul class="org-ul">
<li>Implement scrapers using BeautifulSoup and API clients to gather heterogeneous data.</li>
<li>Use GeoPandas for geospatial data processing and time series analysis.</li>
<li>Combine with machine learning models to predict localized risk factors.</li>
<li>Validate predictions with historical event data.</li>
</ul>
</div>
</div>
<div id="outline-container-org1674c41" class="outline-3">
<h3 id="org1674c41"><span class="section-number-3">11.4.</span> Expected Contributions</h3>
<div class="outline-text-3" id="text-11-4">
<ul class="org-ul">
<li>Integrated climate data platform supporting disaster risk modeling.</li>
<li>Methodologies for scraping and processing heterogeneous geospatial data.</li>
<li>Open-source tools for climate researchers and policymakers.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org973269e" class="outline-2">
<h2 id="org973269e"><span class="section-number-2">12.</span> Evaluation Criteria</h2>
<div class="outline-text-2" id="text-12">
<ul class="org-ul">
<li><b><b>Feasibility:</b></b> Preference for projects with accessible, open-source datasets (e.g., CIC-Darknet2025 for dark web analysis), and manageable resource requirements.</li>
<li><b><b>Novelty:</b></b> Emphasis on under-explored areas such as AR/VR security, homomorphic encryption in gaming, and federated learning in security contexts.</li>
<li><b><b>Impact:</b></b> Focus on high-demand industry problems including GDPR-compliant scraping, scalable anti-cheat technologies, and quantum-resistant cryptography for IoT.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2025</p>
<p class="author">Author: Kornel Hajto</p>
<p class="date">Created: 2025-05-16 Fri 19:44</p>
</div>
</body>
</html>
