ideas.tex
\section{9. AI-Generated Code Security Auditing}
\label{sec:orgc965bcc}
\subsection{Motivation}
\label{sec:org2eb0a15}
AI-generated code, increasingly prevalent via tools like GitHub Copilot, may unintentionally embed security flaws or malicious backdoors. Automated auditing is necessary to maintain code integrity.
\subsection{Research Objective}
\label{sec:org4211676}
Create a static analysis tool augmented by machine learning trained to detect hidden malicious patterns in AI-generated procedural code, focusing on platforms like Unity Asset Store.
\subsection{Methodology}
\label{sec:org7e64123}
\begin{itemize}
\item Collect and label datasets containing malicious and benign Unity assets.
\item Train ML classifiers to identify suspicious code structures and behaviors.
\item Integrate the tool into developer workflows for real-time auditing.
\item Validate efficacy in identifying stealth backdoors.
\end{itemize}
\subsection{Expected Contributions}
\label{sec:org9ead3ac}
\begin{itemize}
\item Novel datasets for AI-generated code security research.
\item Automated auditing tools to improve software supply chain security.
\item Guidelines for safer AI-assisted software development.
\end{itemize}
\section{10. Web Scraping for Climate Risk Modeling}
\label{sec:orgb7023d2}
\subsection{Motivation}
\label{sec:org0079a31}
Climate data is dispersed across multiple sources, often lacking integration necessary for accurate flood and fire risk prediction. Automated data aggregation supports timely, localized risk assessments.
\subsection{Research Objective}
\label{sec:org031b4e0}
Develop a comprehensive web scraping framework to aggregate climate data from APIs (NOAA, Wunderground) and satellite imagery for spatial-temporal analysis of flood and fire risks.
\subsection{Methodology}
\label{sec:org1d7f813}
\begin{itemize}
\item Implement scrapers using BeautifulSoup and API clients to gather heterogeneous data.
\item Use GeoPandas for geospatial data processing and time series analysis.
\item Combine with machine learning models to predict localized risk factors.
\item Validate predictions with historical event data.
\end{itemize}
\subsection{Expected Contributions}
\label{sec:org78e2980}
\begin{itemize}
\item Integrated climate data platform supporting disaster risk modeling.
\item Methodologies for scraping and processing heterogeneous geospatial data.
\item Open-source tools for climate researchers and policymakers.
\end{itemize}
\section{Evaluation Criteria}
\label{sec:org8fe2d46}
\begin{itemize}
\item \textbf{\textbf{Feasibility:}} Preference for projects with accessible, open-source datasets (e.g., CIC-Darknet2025 for dark web analysis), and manageable resource requirements.
\item \textbf{\textbf{Novelty:}} Emphasis on under-explored areas such as AR/VR security, homomorphic encryption in gaming, and federated learning in security contexts.
\item \textbf{\textbf{Impact:}} Focus on high-demand industry problems including GDPR-compliant scraping, scalable anti-cheat technologies, and quantum-resistant cryptography for IoT.
\end{itemize}
\end{document}
